fixtures/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:slim="http://slim.ouertani.me/">
   <soapenv:Header/>
   <soapenv:Body>
      <slim:divide>
         <input>
            <a>6</a>
            <b>4</b>
         </input>
      </slim:divide>
   </soapenv:Body>
</soapenv:Envelope>